tests/API_REST/jmeter.log
2021-01-31 02:27:33,996 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2021-01-31 02:27:34,018 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.1.1/bin/user.properties
2021-01-31 02:27:34,018 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.1.1/bin/system.properties
2021-01-31 02:27:34,018 INFO o.a.j.JMeter: Setting System property: log_level.jmeter=DEBUG
2021-01-31 02:27:34,019 INFO o.a.j.JMeter: Setting JMeter property: TARGET_THREADS=3
2021-01-31 02:27:34,019 WARN o.a.j.JMeter: Removing JMeter property: TARGET_TOKEN
2021-01-31 02:27:34,019 INFO o.a.j.JMeter: Setting JMeter property: TARGET_TIME=1
2021-01-31 02:27:34,019 INFO o.a.j.JMeter: Setting JMeter property: TARGET_LOOPS=1
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: java.version=1.8.0_222
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: os.name=Linux
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: os.arch=amd64
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: os.version=5.4.0-1037-aws
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: file.encoding=UTF-8
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: java.awt.headless=true
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: Max memory     =25979518976
2021-01-31 02:27:34,025 INFO o.a.j.JMeter: Available Processors =8
2021-01-31 02:27:34,031 INFO o.a.j.JMeter: Default Locale=English (EN)
2021-01-31 02:27:34,031 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2021-01-31 02:27:34,031 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.1.1
2021-01-31 02:27:34,031 INFO o.a.j.JMeter: user.dir  =/home/ubuntu/jmeter
2021-01-31 02:27:34,032 INFO o.a.j.JMeter: PWD       =/home/ubuntu/jmeter
2021-01-31 02:27:34,032 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: 6bb7af68c7c3 FullName: 6bb7af68c7c3
2021-01-31 02:27:34,035 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/home/ubuntu/jmeter/tests/API_REST/report-2021-01-31-02-27'
2021-01-31 02:27:34,037 INFO o.a.j.s.FileServer: Default base='/home/ubuntu/jmeter'
2021-01-31 02:27:34,043 INFO o.a.j.s.FileServer: Set new base='/home/ubuntu/jmeter/tests/API_REST'
2021-01-31 02:27:34,215 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2021-01-31 02:27:34,233 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2021-01-31 02:27:34,239 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2021-01-31 02:27:34,247 INFO o.a.j.s.SaveService: Loading file: tests/API_REST/API_REST_FULL.jmx
2021-01-31 02:27:34,306 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-01-31 02:27:34,306 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-01-31 02:27:34,306 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-01-31 02:27:34,306 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2021-01-31 02:27:34,306 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2021-01-31 02:27:34,306 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2021-01-31 02:27:34,367 INFO o.a.j.JMeter: Creating summariser <summary>
2021-01-31 02:27:34,375 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2021-01-31 02:27:34,375 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: tests/API_REST/test-plan.jtl
2021-01-31 02:27:34,375 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /opt/apache-jmeter-5.1.1/bin/reportgenerator.properties
2021-01-31 02:27:34,375 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2021-01-31 02:27:34,381 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2021-01-31 02:27:34,385 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2021-01-31 02:27:34,385 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2021-01-31 02:27:34,385 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2021-01-31 02:27:34,385 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2021-01-31 02:27:34,385 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2021-01-31 02:27:34,385 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2021-01-31 02:27:34,386 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2021-01-31 02:27:34,386 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2021-01-31 02:27:34,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,392 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,392 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,392 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,392 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,392 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,392 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,393 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,393 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,393 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2021-01-31 02:27:34,394 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2021-01-31 02:27:34,394 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2021-01-31 02:27:34,394 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2021-01-31 02:27:34,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2021-01-31 02:27:34,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2021-01-31 02:27:34,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2021-01-31 02:27:34,400 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2021-01-31 02:27:34,401 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-01-31 02:27:34,401 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2021-01-31 02:27:34,408 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2021-01-31 02:27:34,409 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2021-01-31 02:27:34,796 INFO o.a.j.JMeter: Running test (1612060054796)
2021-01-31 02:27:35,019 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Grupo de Hilos
2021-01-31 02:27:35,020 INFO o.a.j.e.StandardJMeterEngine: Starting 3 threads for group Grupo de Hilos.
2021-01-31 02:27:35,020 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2021-01-31 02:27:35,020 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=3 ramp-up=1 delayedStart=false
2021-01-31 02:27:35,030 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2021-01-31 02:27:35,030 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2021-01-31 02:27:35,030 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Hilos 1-1
2021-01-31 02:27:35,052 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 6bb7af68c7c3
2021-01-31 02:27:35,061 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2021-01-31 02:27:35,063 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2021-01-31 02:27:35,063 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2021-01-31 02:27:35,063 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2021-01-31 02:27:35,063 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2021-01-31 02:27:35,179 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2021-01-31 02:27:35,186 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2021-01-31 02:27:35,187 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2021-01-31 02:27:35,331 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2021-01-31 02:27:35,334 INFO o.a.j.u.SSLManager: KeyStore created OK
2021-01-31 02:27:35,335 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2021-01-31 02:27:35,356 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Hilos 1-2
2021-01-31 02:27:35,689 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Hilos 1-3
2021-01-31 02:27:35,934 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    0.9/s Avg:   795 Min:   795 Max:   795 Err:     0 (0.00%) Active: 3 Started: 3 Finished: 0
2021-01-31 02:27:39,564 INFO o.a.j.t.JMeterThread: Thread is done: Grupo de Hilos 1-1
2021-01-31 02:27:39,564 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Hilos 1-1
2021-01-31 02:27:40,052 INFO o.a.j.t.JMeterThread: Thread is done: Grupo de Hilos 1-3
2021-01-31 02:27:40,052 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Hilos 1-3
2021-01-31 02:27:40,383 INFO o.a.j.t.JMeterThread: Thread is done: Grupo de Hilos 1-2
2021-01-31 02:27:40,383 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Hilos 1-2
2021-01-31 02:27:40,384 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2021-01-31 02:27:40,385 INFO o.a.j.r.Summariser: summary +     38 in 00:00:04 =    8.5/s Avg:   341 Min:    92 Max:  1863 Err:     0 (0.00%) Active: 0 Started: 3 Finished: 3
2021-01-31 02:27:40,385 INFO o.a.j.r.Summariser: summary =     39 in 00:00:06 =    7.0/s Avg:   353 Min:    92 Max:  1863 Err:     0 (0.00%)
2021-01-31 02:27:40,385 INFO o.a.j.JMeter: Generating Dashboard
2021-01-31 02:27:40,385 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2021-01-31 02:27:40,396 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2021-01-31 02:27:40,484 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2021-01-31 02:27:40,484 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2021-01-31 02:27:40,487 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2021-01-31 02:27:40,487 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2021-01-31 02:27:40,492 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2021-01-31 02:27:40,499 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2021-01-31 02:27:40,499 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2021-01-31 02:27:40,499 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2021-01-31 02:27:40,510 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2021-01-31 02:27:40,510 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2021-01-31 02:27:40,510 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2021-01-31 02:27:40,510 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2021-01-31 02:27:40,513 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2021-01-31 02:27:40,514 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 273 samples
2021-01-31 02:27:40,514 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2021-01-31 02:27:40,514 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2021-01-31 02:27:40,514 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2021-01-31 02:27:40,515 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2021-01-31 02:27:40,515 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2021-01-31 02:27:40,515 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2021-01-31 02:27:40,520 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2021-01-31 02:27:40,521 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2021-01-31 02:27:40,521 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2021-01-31 02:27:40,521 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2021-01-31 02:27:40,521 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 585 samples
2021-01-31 02:27:40,521 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 117 samples
2021-01-31 02:27:40,521 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 39 samples
2021-01-31 02:27:40,522 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 39 samples produced in 95ms on channel 0
2021-01-31 02:27:40,522 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2021-01-31 02:27:40,524 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2021-01-31 02:27:40,524 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2021-01-31 02:27:40,525 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2021-01-31 02:27:40,525 INFO o.a.j.r.d.JsonExporter: Checking output folder
2021-01-31 02:27:40,526 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /home/ubuntu/jmeter/tests/API_REST/report-2021-01-31-02-27/statistics.json
2021-01-31 02:27:40,730 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2021-01-31 02:27:40,733 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /home/ubuntu/jmeter/tests/API_REST/report-2021-01-31-02-27
2021-01-31 02:27:40,843 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /home/ubuntu/jmeter/tests/API_REST/report-2021-01-31-02-27, creating folder structure
2021-01-31 02:27:40,848 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/opt/apache-jmeter-5.1.1/bin/report-template' to '/home/ubuntu/jmeter/tests/API_REST/report-2021-01-31-02-27', got message:[/home/ubuntu/jmeter/tests/API_REST/report-2021-01-31-02-27/statistics.json], found non empty folder with following content {}, will be ignored
2021-01-31 02:27:41,110 INFO o.a.j.JMeter: Dashboard generated