tests/API_REST/report-2021-01-30-20-55/statistics.json
{
  "SeparateStock" : {
    "transaction" : "SeparateStock",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 296.0,
    "minResTime" : 296.0,
    "maxResTime" : 296.0,
    "pct1ResTime" : 296.0,
    "pct2ResTime" : 296.0,
    "pct3ResTime" : 296.0,
    "throughput" : 3.3783783783783785,
    "receivedKBytesPerSec" : 0.9138777449324325,
    "sentKBytesPerSec" : 1.6726932010135136
  },
  "ConfigValuesDocumentTypeList" : {
    "transaction" : "ConfigValuesDocumentTypeList",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.0,
    "minResTime" : 23.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 23.0,
    "pct2ResTime" : 23.0,
    "pct3ResTime" : 23.0,
    "throughput" : 43.47826086956522,
    "receivedKBytesPerSec" : 23.225203804347828,
    "sentKBytesPerSec" : 11.251698369565217
  },
  "productSearch" : {
    "transaction" : "productSearch",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 434.0,
    "minResTime" : 434.0,
    "maxResTime" : 434.0,
    "pct1ResTime" : 434.0,
    "pct2ResTime" : 434.0,
    "pct3ResTime" : 434.0,
    "throughput" : 2.304147465437788,
    "receivedKBytesPerSec" : 10.661182315668203,
    "sentKBytesPerSec" : 0.8370535714285714
  },
  "Category" : {
    "transaction" : "Category",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 662.0,
    "minResTime" : 662.0,
    "maxResTime" : 662.0,
    "pct1ResTime" : 662.0,
    "pct2ResTime" : 662.0,
    "pct3ResTime" : 662.0,
    "throughput" : 1.5105740181268883,
    "receivedKBytesPerSec" : 1.919196091389728,
    "sentKBytesPerSec" : 0.27290643882175225
  },
  "ConfigValues" : {
    "transaction" : "ConfigValues",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 35.0,
    "minResTime" : 35.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 35.0,
    "pct3ResTime" : 35.0,
    "throughput" : 28.57142857142857,
    "receivedKBytesPerSec" : 41.043526785714285,
    "sentKBytesPerSec" : 4.715401785714286
  },
  "RelationShipList" : {
    "transaction" : "RelationShipList",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.0,
    "minResTime" : 14.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 71.42857142857143,
    "receivedKBytesPerSec" : 95.77287946428571,
    "sentKBytesPerSec" : 11.439732142857142
  },
  "OrderDetail" : {
    "transaction" : "OrderDetail",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.0,
    "minResTime" : 19.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 19.0,
    "throughput" : 52.63157894736842,
    "receivedKBytesPerSec" : 33.40871710526316,
    "sentKBytesPerSec" : 12.592516447368421
  },
  "User/Update" : {
    "transaction" : "User/Update",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.0,
    "minResTime" : 21.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 21.0,
    "pct2ResTime" : 21.0,
    "pct3ResTime" : 21.0,
    "throughput" : 47.61904761904761,
    "receivedKBytesPerSec" : 27.94828869047619,
    "sentKBytesPerSec" : 21.391369047619047
  },
  "User/Detail" : {
    "transaction" : "User/Detail",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.0,
    "minResTime" : 25.0,
    "maxResTime" : 25.0,
    "pct1ResTime" : 25.0,
    "pct2ResTime" : 25.0,
    "pct3ResTime" : 25.0,
    "throughput" : 40.0,
    "receivedKBytesPerSec" : 22.265625,
    "sentKBytesPerSec" : 11.2890625
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 13,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 266.3076923076923,
    "minResTime" : 14.0,
    "maxResTime" : 1839.0,
    "pct1ResTime" : 1368.1999999999996,
    "pct2ResTime" : 1839.0,
    "pct3ResTime" : 1839.0,
    "throughput" : 3.735632183908046,
    "receivedKBytesPerSec" : 6.42230154454023,
    "sentKBytesPerSec" : 1.0324061602011494
  },
  "SubCategory" : {
    "transaction" : "SubCategory",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 20.0,
    "minResTime" : 20.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 20.0,
    "throughput" : 50.0,
    "receivedKBytesPerSec" : 74.755859375,
    "sentKBytesPerSec" : 8.740234375
  },
  "StoreList" : {
    "transaction" : "StoreList",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.0,
    "minResTime" : 14.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 71.42857142857143,
    "receivedKBytesPerSec" : 73.10267857142857,
    "sentKBytesPerSec" : 12.486049107142858
  },
  "OrderList" : {
    "transaction" : "OrderList",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 60.0,
    "minResTime" : 60.0,
    "maxResTime" : 60.0,
    "pct1ResTime" : 60.0,
    "pct2ResTime" : 60.0,
    "pct3ResTime" : 60.0,
    "throughput" : 16.666666666666668,
    "receivedKBytesPerSec" : 34.34244791666667,
    "sentKBytesPerSec" : 4.573567708333334
  },
  "productList" : {
    "transaction" : "productList",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1839.0,
    "minResTime" : 1839.0,
    "maxResTime" : 1839.0,
    "pct1ResTime" : 1839.0,
    "pct2ResTime" : 1839.0,
    "pct3ResTime" : 1839.0,
    "throughput" : 0.543773790103317,
    "receivedKBytesPerSec" : 3.5414330138662318,
    "sentKBytesPerSec" : 0.2039151712887439
  }
}