tests/API_REST/report-2021-01-31-02-27/statistics.json
{
  "SeparateStock" : {
    "transaction" : "SeparateStock",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 348.6666666666667,
    "minResTime" : 316.0,
    "maxResTime" : 412.0,
    "pct1ResTime" : 412.0,
    "pct2ResTime" : 412.0,
    "pct3ResTime" : 412.0,
    "throughput" : 2.640845070422535,
    "receivedKBytesPerSec" : 0.7143692231514085,
    "sentKBytesPerSec" : 1.3075277838908452
  },
  "ConfigValuesDocumentTypeList" : {
    "transaction" : "ConfigValuesDocumentTypeList",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 98.33333333333333,
    "minResTime" : 95.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 9.202453987730062,
    "receivedKBytesPerSec" : 4.915763995398772,
    "sentKBytesPerSec" : 2.381494440184049
  },
  "productSearch" : {
    "transaction" : "productSearch",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 800.3333333333334,
    "minResTime" : 652.0,
    "maxResTime" : 1003.0,
    "pct1ResTime" : 1003.0,
    "pct2ResTime" : 1003.0,
    "pct3ResTime" : 1003.0,
    "throughput" : 2.6019080659150045,
    "receivedKBytesPerSec" : 12.038906656548136,
    "sentKBytesPerSec" : 0.9452244145706852
  },
  "Category" : {
    "transaction" : "Category",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 614.0,
    "minResTime" : 474.0,
    "maxResTime" : 795.0,
    "pct1ResTime" : 795.0,
    "pct2ResTime" : 795.0,
    "pct3ResTime" : 795.0,
    "throughput" : 2.9182879377431905,
    "receivedKBytesPerSec" : 3.707707624027237,
    "sentKBytesPerSec" : 0.5272297543774319
  },
  "ConfigValues" : {
    "transaction" : "ConfigValues",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 127.66666666666667,
    "minResTime" : 112.0,
    "maxResTime" : 151.0,
    "pct1ResTime" : 151.0,
    "pct2ResTime" : 151.0,
    "pct3ResTime" : 151.0,
    "throughput" : 8.426966292134832,
    "receivedKBytesPerSec" : 12.105534585674159,
    "sentKBytesPerSec" : 1.3907786165730338
  },
  "RelationShipList" : {
    "transaction" : "RelationShipList",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 93.0,
    "minResTime" : 92.0,
    "maxResTime" : 94.0,
    "pct1ResTime" : 94.0,
    "pct2ResTime" : 94.0,
    "pct3ResTime" : 94.0,
    "throughput" : 9.345794392523365,
    "receivedKBytesPerSec" : 12.531030957943925,
    "sentKBytesPerSec" : 1.49678738317757
  },
  "OrderDetail" : {
    "transaction" : "OrderDetail",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 130.0,
    "minResTime" : 100.0,
    "maxResTime" : 188.0,
    "pct1ResTime" : 188.0,
    "pct2ResTime" : 188.0,
    "pct3ResTime" : 188.0,
    "throughput" : 4.552352048558422,
    "receivedKBytesPerSec" : 2.889676593323217,
    "sentKBytesPerSec" : 1.0891857928679818
  },
  "User/Update" : {
    "transaction" : "User/Update",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 135.33333333333334,
    "minResTime" : 104.0,
    "maxResTime" : 191.0,
    "pct1ResTime" : 191.0,
    "pct2ResTime" : 191.0,
    "pct3ResTime" : 191.0,
    "throughput" : 3.592814371257485,
    "receivedKBytesPerSec" : 2.108673278443114,
    "sentKBytesPerSec" : 1.6139595808383234
  },
  "User/Detail" : {
    "transaction" : "User/Detail",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 134.66666666666666,
    "minResTime" : 105.0,
    "maxResTime" : 193.0,
    "pct1ResTime" : 193.0,
    "pct2ResTime" : 193.0,
    "pct3ResTime" : 193.0,
    "throughput" : 4.0,
    "receivedKBytesPerSec" : 2.2265625,
    "sentKBytesPerSec" : 1.12890625
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 39,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 353.5641025641026,
    "minResTime" : 92.0,
    "maxResTime" : 1863.0,
    "pct1ResTime" : 1003.0,
    "pct2ResTime" : 1684.0,
    "pct3ResTime" : 1863.0,
    "throughput" : 7.43281875357347,
    "receivedKBytesPerSec" : 12.778507361349343,
    "sentKBytesPerSec" : 2.0541872141223556
  },
  "SubCategory" : {
    "transaction" : "SubCategory",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 109.0,
    "minResTime" : 103.0,
    "maxResTime" : 117.0,
    "pct1ResTime" : 117.0,
    "pct2ResTime" : 117.0,
    "pct3ResTime" : 117.0,
    "throughput" : 8.620689655172413,
    "receivedKBytesPerSec" : 12.888941271551724,
    "sentKBytesPerSec" : 1.5069369612068966
  },
  "StoreList" : {
    "transaction" : "StoreList",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 95.66666666666667,
    "minResTime" : 94.0,
    "maxResTime" : 99.0,
    "pct1ResTime" : 99.0,
    "pct2ResTime" : 99.0,
    "pct3ResTime" : 99.0,
    "throughput" : 9.11854103343465,
    "receivedKBytesPerSec" : 9.332256838905774,
    "sentKBytesPerSec" : 1.5939637158054711
  },
  "OrderList" : {
    "transaction" : "OrderList",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 172.0,
    "minResTime" : 131.0,
    "maxResTime" : 254.0,
    "pct1ResTime" : 254.0,
    "pct2ResTime" : 254.0,
    "pct3ResTime" : 254.0,
    "throughput" : 4.777070063694267,
    "receivedKBytesPerSec" : 9.843376791401274,
    "sentKBytesPerSec" : 1.3108952030254777
  },
  "productList" : {
    "transaction" : "productList",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1737.6666666666667,
    "minResTime" : 1666.0,
    "maxResTime" : 1863.0,
    "pct1ResTime" : 1863.0,
    "pct2ResTime" : 1863.0,
    "pct3ResTime" : 1863.0,
    "throughput" : 1.4347202295552368,
    "receivedKBytesPerSec" : 9.343895713773314,
    "sentKBytesPerSec" : 0.5380200860832137
  }
}